Core/src/src/Catalogs/ДЛ_СтатьиУниверсальногоОтчета/ДЛ_СтатьиУниверсальногоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_СтатьиУниверсальногоОтчета</name>
  <owners>Catalog.ДЛ_ВидыУниверсальныхОтчетов</owners>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФормулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Источники</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИсточника</name>
      <type>
        <types>EnumRef.ДЛ_ТипыИсточниковДанныхСтатьи</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Формулы</name>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Catalogs/ДЛ_СтатьиУниверсальногоОтчета/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЦветФонаСтатьи = Объект.Ссылка.ЦветФонаСтатьи.Получить();
		ЦветТекстаСтатьи = Объект.Ссылка.ЦветТекстаСтатьи.Получить();
		ШрифтСтатьи = Объект.Ссылка.ШрифтСтатьи.Получить();
	Иначе
		ЦветФонаСтатьи = Новый Цвет(255, 255, 255);
		ЦветТекстаСтатьи = Новый Цвет(0, 0, 0);
		ШрифтСтатьи = Новый Шрифт("Arial", 8);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФонаСтатьи = Новый ХранилищеЗначения(ЦветФонаСтатьи);
	ТекущийОбъект.ЦветТекстаСтатьи = Новый ХранилищеЗначения(ЦветТекстаСтатьи);
	ТекущийОбъект.ШрифтСтатьи = Новый ХранилищеЗначения(ШрифтСтатьи);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулыФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Объект.Формулы.НайтиПоИдентификатору(Элементы.Формулы.ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Объект.Владелец);
	ПараметрыФормы.Вставить("Формула", ТекущиеДанные.Формула);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеФормулы", ЭтаФорма);
	
	ОткрытьФорму("Справочник.ДЛ_СтатьиУниверсальногоОтчета.Форма.ФормаРедакторФормулы", ПараметрыФормы, Элемент,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеФормулы(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
	
		Если Элементы.Формулы.ТекущаяСтрока <> Неопределено Тогда
		
			ТекущиеДанные = Объект.Формулы.НайтиПоИдентификатору(Элементы.Формулы.ТекущаяСтрока);
			ТекущиеДанные.Формула = Результат;
		
		КонецЕсли; 
	
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
